In [74]:
# Import Libraries and Data
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [75]:
url ='https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'
user = pd.read_csv(url,sep='|')
user.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [76]:
#user.columns

In [77]:
#user['user_id|age|gender|occupation|zip_code'].str.split('|',expand=True)

In [78]:
#split the data frame 
# user[['user_id','age','gender','occupation','zip_code']] = user['user_id|age|gender|occupation|zip_code'].str.split('|',expand=True)
# user.head()

In [79]:
# set the user_id as index and drop the first column
user = user.set_index('user_id')

In [80]:
# Refine data
user.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

In [81]:
# See the last 10 rows 
print(user.tail(10))

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

In [84]:
# Number of observation in the data
print('Total no of observations: ',user.shape[0])

Total no of observations:  943

In [85]:
# Number of columns in the data
print('Total no of columns: ',user.shape[1])

Total no of columns:  4

In [87]:
# name of the columns
print('Names of the Columns: ',user.columns)

Names of the Columns:  Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [92]:
user.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

In [89]:
# What is the data type of the columns
print(user.dtypes)

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [102]:
user.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

In [94]:
# Print only occupation column
print(user['occupation'])

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [101]:
# Count most occuring occupation
print('top five occuring occupation:')
user['occupation'].value_counts().head(5)

top five occuring occupation:

student          196
other            105
educator          95
administrator     79
engineer          67
Name: occupation, dtype: int64

In [104]:
# how many different occupation there 
print('Total no of different occupation: ',user['occupation'].nunique())

Total no of different occupation:  21

In [108]:
# most frequent occupation
print('Most frequent occupation: ',user['occupation'].mode()[0])

Most frequent occupation:  student

In [111]:
user['occupation'].value_counts().head(1)

student    196
Name: occupation, dtype: int64

In [109]:
# Summarize the data
print(user.describe())

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

In [112]:
#summerize all columns
print(user.describe(include='all'))

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

In [113]:
# mean of age
print('Mean of age: ',user['age'].mean())

Mean of age:  34.05196182396607

In [117]:
# the age with least occurance
print('Age with least occurance: ',user['age'].value_counts().idxmin())

Age with least occurance:  7